import type { image } from "d3";

interface CardTheme {
  name: string;
  description: string;
  src: string;
}

// name, description, imageUrl for each card
export const cardThemes = {
        justice: {
          src: "src/lib/assets/card/card-1.svg",
          back_src: "src/lib/assets/card/card-template.svg",
          name: 'Justice - ความยุติธรรม',
          intro: "ความยุติธรรม",
          meaning:
            "การเข้าถึงบริการทำแท้งโดยไม่ถูกเลือกปฏิบัติและเคารพการตัดสินใจคือความยุติธรรม",
          message: "กฎแห่งจักรวาลย้ำเตือนเราว่า อำนาจตัดสินใจในเนื้อตัวร่างกายเป็นสิทธิขั้นพื้นฐาน ความยุติธรรมไม่ใช่แค่เรื่องตัวบทกฎหมาย แต่คือความเท่าเทียม เข้าถึงได้จริง และเชื่อว่าผู้หญิงและผู้ท้องไม่พร้อม สามารถเลือกสิ่งที่ดีให้กับร่างกายตัวเอง โดยไม่มีความผิดทางอาญามากำหนดกรอบ",
          affirmation: "ฉันเชื่อในสิทธิในเนื้อตัวร่างกายของฉัน การตัดสินใจของฉันเป็นสิ่งที่ชอบธรรม",
          reflect: "ความเป็นธรรมด้านสิทธิการทำแท้งเป็นยังไงบ้างในจังหวัดของคุณ\nใครคือคนที่ได้รับผลกระทบจากการทำแท้งที่ไม่ได้เข้าถึงง่าย\nคุณจะช่วยส่งเสียงผลักดันการทำแท้งปลอดภัยให้เข้าถึงง่ายสำหรับทุกคนได้อย่างไร?",
        },
        choice: {
          src: "src/lib/assets/card/card-2.svg",
          back_src: "src/lib/assets/card/card-template.svg",
          name: 'Choice - สิทธิในการเลือก',
          intro: "สิทธิในการเลือก",
          meaning:
            "ร่างกายของคุณ คือการตัดสินใจของคุณ",
          message: "ยูเรนัสทำลายโซ่ตรวน การตัดสินใจเลือกคือการปฏิวัติเปลี่ยนแปลง พลังในการกำหนดร่างกายและชีวิตของคุณเอง จังหวะเวลาในแบบของคุณ และครอบครัวแบบที่คุณต้องการ\nอำนาจตัดสินใจในชีวิตของคุณไม่ใช่สิ่งที่ต้องรอขออนุญาตจากคนอื่น คุณรู้จักชีวิตของคุณดีที่สุด",
          affirmation: "การตัดสินใจของฉันคือสิ่งศักดิ์สิทธิ์ อำนาจตัดสินใจในเนื้อตัวร่างกายไม่ใช่สิ่งที่สามารถต่อรองได้",
          reflect: "การยืนยันสิทธิในการเลือกของคุณ ส่งแรงกระเพื่อมไปสู่การปลดปล่อยชีวิตคุณในด้านอื่นๆ อย่างไร",
        },
        healing: {
          src: "src/lib/assets/card/card-3.svg",
          back_src: "src/lib/assets/card/card-template.svg",
          name: 'Healing - การเยียวยา',
          intro: "การเยียวยา",
          meaning:
            "การดูแลตนเองและผู้อื่นด้วยความอ่อนโยน ละเอียดอ่อนและเข้าใจ",
          message: "ไครอน ผู้เยียวยาบาดแผล สอนเราว่าประสบการณ์ไม่ว่าจะรู้สึกซับซ้อน เจ็บปวด หรือเป็นอิสระ ล้วนมีความหมายและได้รับยอมรับ\nการเยียวยาไม่ได้เกิดขึ้นเป็นเส้นตรง โอบรับทั้งความโศกเศร้าและและความโล่งอกสบายใจ",
          affirmation: "ฉันอนุญาตให้ตัวเองรู้สึกทุกอย่าง โดยปราศจากคำตัดสิน",
          reflect: "ร่างกายของคุณต้องการอะไรในตอนนี้ พักผ่อน? ขยับตัวเคลื่อนไหว? อยู่ลำพัง? อยู่ร่วมกับชุมชน? หรือเปลี่ยนแปลงสู่สิ่งใหม่?\nแล้วคุณจะดูแลความต้องการทั้งหมดนั้นได้อย่างไร",
        },
        knowledge: {
          src: "src/lib/assets/card/card-4.svg",
          back_src: "src/lib/assets/card/card-template.svg",
          name: 'Knowledge - ความรู้',
          intro: "ความรู้",
          meaning: "ข้อมูลที่ถูกต้องคือพลังอำนาจ",
          message: "ความรู้คืออำนาจ และข้อมูลเกี่ยวกับการทำแท้งปลอดภัยคือสิทธิของคุณ คุณควรได้รับข้อเท็จจริงที่ครบถ้วน ถูกต้อง ปราศจากอคติต่อการทำแท้ง สำหรับทุกทางเลือกในการตัดสินใจ ไม่ว่าจะเป็นขั้นตอนการรับบริการทำแท้ง หน่วยบริการใกล้คุณ ค่าใช้จ่าย ความเสี่ยง และข้อกฎหมาย",
          affirmation: "ฉันมีสิทธิที่จะได้รับข้อมูลเกี่ยวกับการทำแท้งปลอดภัยที่ครบถ้วนและถูกต้อง และการตัดสินใจบนพื้นฐานของข้อมูลที่ครบถ้วนนั้นทรงพลัง",
          reflect: "ข้อมูลแบบไหนที่คุณอยากรู้เพิ่มเติมเพื่อประกอบการตัดสินใจทำแท้ง?\nคุณจะตามหาแหล่งข้อมูลที่น่าเชื่อถือได้จากไหน?\nคุณสามารถส่งต่อความรู้ที่มีไปถึงคนรอบตัวได้อย่างไร?\nความรู้และความเชื่อแบบไหนที่คุณอยากละทิ้ง แล้วเรียนรู้ขึ้นมาใหม่?",
        },
        support: {
          src: "src/lib/assets/card/card-5.svg",
          back_src: "src/lib/assets/card/card-template.svg",
          name: 'Support - การสนับสนุน',
          intro: "การสนับสนุน",
          meaning:
            "ไม่มีใครควรเผชิญกับสิ่งนี้เพียงลำพัง",
          message: "พลังการดูแลที่มองไม่เห็นโอบอุ้มพวกเรา เหมือนดวงจันทร์ทำให้น้ำขึ้น คุณไม่ได้เผชิญอยู่ลำพัง ชุมชนและเครือข่ายของการดูแล - ครอบครัวที่เราเลือกเอง เครือข่ายที่สนับสนุนการทำแท้งปลอดภัย พร้อมอยู่เคียงข้างคุณในวันที่คุณตัดสินใจเรื่องสำคัญของชีวิตและร่างกายของคุณเอง",
          affirmation: "ฉันมีคุณค่าที่จะได้รับการดูแล ความรัก และเป็นส่วนหนึ่งของชุมชน",
          reflect: "ใครที่พร้อมจะสนับสนุนและดูแลคุณในช่วงก่อน ระหว่าง และหลังการทำแท้งปลอดภัย? และคุณจะเป็นคนนั้นให้ผู้อื่นได้อย่างไร",
        },
        safety: {
          src: "src/lib/assets/card/card-6.svg",
          back_src: "src/lib/assets/card/card-template.svg",
          name: 'Safety - ความปลอดภัย',
          intro: "ความปลอดภัย",
          meaning:
            "การเข้าถึงบริการทำแท้งปลอดภัยคือสิทธิพื้นฐาน",
          message: "ดาวเสาร์เป็นตัวแทนของการปกป้องคุ้มกัน ความปลอดภัยเป็นทั้งเรื่องความมั่นคงทางกายใจและการเข้าถึงการดูแล การคุ้มครองจากการถูกปฏิเสธโดยหน่วยบริการและบุคลากรทางการแพทย์\nคุณควรได้ตัดสินใจอย่างปลอดภัยในพื้นที่ที่ปราศจากการบีบบังคับและไม่ยอมรับการตัดสินใจของคุณ",
          affirmation: "ฉันจะสร้างพื้นที่ปลอดภัยสำหรับเส้นทางที่ฉันตัดสินใจ",
          reflect: "การได้รับบริการสุขภาพที่ปลอดภัยแบบไหนที่คุณต้องการ?\nพวกเราจะสร้างสิ่งนั้นร่วมกันได้ยังไง เมื่อไม่รู้ว่าสถานบริการทำแท้งปลอดภัยอยู่ที่ไหนบ้าง?",
        },
      };

export const actioncardThemes = {
        safety: {
          src: "src/lib/assets/card/action-card-1.svg",
          name: "ยกเลิกความผิด 'การทำแท้ง' ประกันสิทธิไว้ในรัฐธรรมนูญ",
          filename: 'aborion-action-card-legal',
        },
        provider: {
          src: "src/lib/assets/card/action-card-2.svg",
          name: "รัฐต้องรับรองการเข้าถึงบริการ 'ทำแท้งปลอดภัย' ของทุกคนถ้วนหน้า",
          filename: 'aborion-action-card-access',
        },
        knowledge: {
          src: "src/lib/assets/card/action-card-3.svg",
          name: "ควบคุมคุณภาพและมาตรฐาน 'ทำแท้งปลอดภัย' เข้าใจ ให้เกียรติ ละเอียดอ่อน",
          filename: 'aborion-action-card-awareness',
        },
      };